In [1]:
import numpy as np
import pandas as pd

## Задачи для старта

1. Создайте из списка в 10 элементов от 1 до 10 объект Series, выведите 5 элемент, выведите второй и третий элементы.

2. Создайте Series из 10 случайных чисел int и задайте индексы из любых букв алфавита (a, b, c и т.д.)

3. Создайте Series из словаря, который описывает 5 пар значений номер группы и количество студентов в группе. Выведите срез по первым трем группам.

4. Создайте DataFrame из двух Series, которые описывают соответственно первый - 5 групп, количество студентов в группе и второй - те же 5 групп и количество отличников в них. 



6. Создайте DataFrame из двумерного массива 3 на 2 случайных чисел int, индексов a, b, c и колонок one two.

7. В DataFrame из задания 4 добавьте стетий столбец Proportin и внесите в нее отношение отличников к общему числу студентов в группе.

8. Используя DataFrame из задания 7 выведите срез первых двух столбцов и первых трех групп с помощью неявной индексации.

9. Используя DataFrame из задания 7 выведите срез первых двух столбцов и первых трех строк с помощью явной индексации.

10. Используя DataFrame из задания 7 выведите все группы, в которых количество студентов больше 25, долны быть выведены также данные по  столбцам Excellent student и Proportin.

# Файлы

In [36]:
from google.colab import files
uploaded = files.upload()

ModuleNotFoundError: No module named 'google'

# Задачи для старта Решение

1. Создайте из списка в 10 элементов от 1 до 10 объект Series, выведите 5 элемент, выведите второй и третий элементы.

In [3]:
ser1 = pd.Series(list(range(1, 11)))
ser1[4], ser1[1], ser1[2]

(5, 2, 3)

2. Создайте Series из 10 случайных чисел int и задайте индексы из любых букв алфавита (a, b, c и т.д.)

In [4]:
ser2 = pd.Series(np.random.randint(1, 100, size=10), index=[chr(ord('a') + i) for i in range(10)])
ser2

a    43
b    22
c    76
d     7
e    61
f    53
g    64
h    10
i    98
j    42
dtype: int32

3. Создайте Series из словаря, который описывает 5 пар значений номер группы и количество студентов в группе. Выведите срез по первым трем группам.

In [5]:
d = {1:25, 2:26, 3:23, 4:27, 5:21}
sr3 = pd.Series(d)
sr3[:3]

1    25
2    26
3    23
dtype: int64

4. Создайте DataFrame из двух Series, которые описывают соответственно первый - 5 групп, количество студентов в группе и второй - те же 5 групп и количество отличников в них.

In [6]:
d1 = {1:25, 2:26, 3:23, 4:27, 5:21}
d2 = {1:3, 2:4, 3:5, 4:2, 5:6}
df1 = pd.DataFrame({'Total students':d1, 'Excellent students':d2})
df1

   Total students  Excellent students
1              25                   3
2              26                   4
3              23                   5
4              27                   2
5              21                   6

6. Создайте DataFrame из двумерного массива 3 на 2 случайных чисел int, индексов a, b, c и колонок one two.

In [7]:
df2 = pd.DataFrame(np.random.randint(1, 100, size=(3, 2)), index=list('abc'), columns=['one', 'two'])
df2

   one  two
a   59   84
b    4   62
c   95   21

7. В DataFrame из задания 4 добавьте стетий столбец Proportin и внесите в нее отношение отличников к общему числу студентов в группе.

In [8]:
df1['Proportion'] = df1['Excellent students'] / df1['Total students']
df1

   Total students  Excellent students  Proportion
1              25                   3    0.120000
2              26                   4    0.153846
3              23                   5    0.217391
4              27                   2    0.074074
5              21                   6    0.285714

8. Используя DataFrame из задания 7 выведите срез первых двух столбцов и первых трех групп с помощью неявной индексации.

In [33]:
df1.iloc[:3, :2]

   Total students  Excellent students
1              25                   3
2              26                   4
3              23                   5

9. Используя DataFrame из задания 7 выведите срез первых двух столбцов и первых трех строк с помощью явной индексации.

In [29]:
# first 3 rows and 2 columns
df1.loc[:3, :'Excellent students']

   Total students  Excellent students
1              25                   3
2              26                   4
3              23                   5

10. Используя DataFrame из задания 7 выведите все группы, в которых количество студентов больше 25, долны быть выведены также данные по  столбцам Excellent student и Proportin.

In [35]:
df1[df1['Total students'] > 25]

   Total students  Excellent students  Proportion
2              26                   4    0.153846
4              27                   2    0.074074

# Задачи для совместного разбора

1. Загрузите данные из файла `sp500hst.txt` и обозначьте столбцы в соответствии с содержимым: `"date", "ticker", "open", "high", "low", "close", "volume"`.

2. Рассчитайте среднее значение показателей для каждого из столбцов c номерами 3-6.

3. Добавьте столбец, содержащий только число месяца, к которому относится дата.

4. Рассчитайте суммарный объем торгов для для одинаковых значений тикеров.

5. Загрузите данные из файла sp500hst.txt и обозначьте столбцы в соответствии с содержимым: "date", "ticker", "open", "high", "low", "close", "volume". Добавьте столбец с расшифровкой названия тикера, используя данные из файла `sp_data2.csv` . В случае нехватки данных об именах тикеров корректно обработать их.

[sp_data2.csv](https://drive.google.com/file/d/1EuN7NVFqZkpFSoqtjuHZ9VI1TeKwAp3U/view?usp=sharing)

[sp500hst.txt](https://drive.google.com/file/d/1H__er8pUdPW4EO2_cl4P8TfhtVotNAY6/view?usp=sharing)

# Задачи для совместного разбора Решение

1. Загрузите данные из файла `sp500hst.txt` и обозначьте столбцы в соответствии с содержимым: `"date", "ticker", "open", "high", "low", "close", "volume"`.

In [11]:
data = pd.read_csv('sp500hst.txt', sep=',', names=['date', 'ticker', 'open', 'high', 'low', 'close', 'volume'])
data.head()

       date ticker   open     high     low  close  volume
0  20090821      A  25.60  25.6100  25.220  25.55   34758
1  20090824      A  25.64  25.7400  25.330  25.50   22247
2  20090825      A  25.50  25.7000  25.225  25.34   30891
3  20090826      A  25.32  25.6425  25.145  25.48   33334
4  20090827      A  25.50  25.5700  25.230  25.54   70176

2. Рассчитайте среднее значение показателей для каждого из столбцов c номерами 3-6.

In [14]:
data.iloc[:, 3:7].mean()

high         43.102243
low          42.054464
close        42.601865
volume    81395.068138
dtype: float64

3. Добавьте столбец, содержащий только число месяца, к которому относится дата.

In [20]:
data['month'] = data['date'].apply(lambda x: str(x)[4:6])
data.head()

       date ticker   open     high     low  close  volume month
0  20090821      A  25.60  25.6100  25.220  25.55   34758    08
1  20090824      A  25.64  25.7400  25.330  25.50   22247    08
2  20090825      A  25.50  25.7000  25.225  25.34   30891    08
3  20090826      A  25.32  25.6425  25.145  25.48   33334    08
4  20090827      A  25.50  25.5700  25.230  25.54   70176    08

4. Рассчитайте суммарный объем торгов для для одинаковых значений тикеров.

In [22]:
data.groupby('ticker')['volume'].sum()

ticker
A        8609336
AA      81898998
AAPL    52261170
ABC      9006756
ABT     18975870
          ...
XTO     21297931
YHOO    56837171
YUM     10971538
ZION    15551119
ZMH      4938916
Name: volume, Length: 524, dtype: int64

5. Загрузите данные из файла sp500hst.txt и обозначьте столбцы в соответствии с содержимым: "date", "ticker", "open", "high", "low", "close", "volume". Добавьте столбец с расшифровкой названия тикера, используя данные из файла `sp_data2.csv` . В случае нехватки данных об именах тикеров корректно обработать их.

In [32]:
data2 = pd.read_csv('sp500hst.txt', sep=',', names=['date', 'ticker', 'open', 'high', 'low', 'close', 'volume'])
data3 = pd.read_csv('sp_data2.csv', sep=';', names=['reduction', 'full', 'percent'])
data2['full_ticker'] = data2['ticker'].apply(lambda x: data3[data3['reduction'] == x]['full'].values[0] if x in data3['reduction'].values else 'unknown')

In [33]:
data2

,date,ticker,open,high,low,close,volume,full_ticker
0,20090821,A,25.60,25.6100,25.220,25.55,34758,Agilent Technologies
1,20090824,A,25.64,25.7400,25.330,25.50,22247,Agilent Technologies
2,20090825,A,25.50,25.7000,25.225,25.34,30891,Agilent Technologies
3,20090826,A,25.32,25.6425,25.145,25.48,33334,Agilent Technologies
4,20090827,A,25.50,25.5700,25.230,25.54,70176,Agilent Technologies
...,...,...,...,...,...,...,...,...
122569,20100813,ZMH,51.72,51.9000,51.380,51.44,14561,unknown
122570,20100816,ZMH,51.13,51.4700,50.600,51.00,13489,unknown
122571,20100817,ZMH,51.14,51.6000,50.890,51.21,20498,unknown
122572,20100819,ZMH,51.63,51.6300,50.170,50.22,18259,unknown
122573,20100820,ZMH,50.03,50.5500,49.480,49.82,17792,unknown